# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [1]:
# 記得先 Import 正確的套件

import pandas as pd
import numpy as np

In [2]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [5]:
#計算每個種類 animal 的 age 的平均數
df.age.mean()

3.4375

In [6]:
#計算每個不同種類 animal 的 age 的平均數
df.groupby('animal').age.mean()

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

In [8]:
#將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
df.sort_values(by=['age'])

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [9]:
#將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
df.replace(['yes','no'],['True','False'])

  animal  age  visits priority
a    cat  2.5       1     True
b    cat  3.0       3     True
c  snake  0.5       2    False
d    dog  NaN       3     True
e    dog  5.0       2    False
f    cat  2.0       3    False
g  snake  4.5       1    False
h    cat  NaN       1     True
i    dog  7.0       2    False
j    dog  3.0       1    False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [10]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.556780  0.494569  0.568515
1  0.154112  0.182329  0.105624
2  0.917191  0.985003  0.390719
3  0.397061  0.799637  0.039128
4  0.439133  0.830243  0.177729

In [22]:
df.sub(df.mean(axis=0),axis=1)

          0         1         2
0  0.063925 -0.163787  0.312172
1 -0.338743 -0.476027 -0.150719
2  0.424336  0.326647  0.134376
3 -0.095794  0.141281 -0.217215
4 -0.053722  0.171887 -0.078614

In [16]:
df.sub(df.mean(axis=1),axis=0)

          0         1         2
0  0.016825 -0.045386  0.028561
1  0.006757  0.034974 -0.041731
2  0.152887  0.220699 -0.373585
3 -0.014881  0.387695 -0.372814
4 -0.043235  0.347875 -0.304639

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [23]:
df

          0         1         2
0  0.556780  0.494569  0.568515
1  0.154112  0.182329  0.105624
2  0.917191  0.985003  0.390719
3  0.397061  0.799637  0.039128
4  0.439133  0.830243  0.177729

In [34]:
df.sum(axis=1).argmin()

1

In [32]:
df.sum(axis=0).argmin()

2